#define _CRT_SECURE_NO_WARNINGS
/***********************************************************/
// [0-0] hello world ����غ���
/***********************************************************/

#if 0	//��ó���� �� ���Ͽ��� 1�� �ϳ��� �־����.
#include <stdio.h>

int main(void)
{
	//솔루션 빌드: ctrl + shift + b
	printf("Hello world!");
	return 0;
}
#endif

/***********************************************************/
// [2-3] ����ڸ� ����� ���
/***********************************************************/

#if 0 
#include <stdio.h>

int main(void)
{
	printf("Goot\bd\tchance\n");	//\b : back space
	printf("Cow\a");	//\a : 알람소리
	return 0;
}
#endif

/***********************************************************/
// [3-1] 변수 선언
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a;	//변수의 선언 : 메모리에 변수 공간을 만드는 작업!
	//int g형 변수 -> 4byte 메모리 초기화
	a = 10; //변수에 값을 할당
	//최초 할당 ->
	printf("%d", a); 
	return 0;
}
#endif

/***********************************************************/
// [3-1] p81 
/***********************************************************/
   // 1. 정수형 변수 b와 c를 선언(int로)
   // 2. 실수형 변수 da 선언 (double로)
   // 3. 문자형 변수 ch 선언 (char로)
   // 4. a에 들어 있는 값으로 b를 초기화
   // 5. a에 들어 있는 값에 20을 더해 c를 초기화
   // 6. da를 3.5로 초기화
   // 7. ch를 'A'로 초기화
   // 모든 변수 출력!!
#if 0
#include <stdio.h>

int main(void)
{
	int a = 10;
	int b, c;
	double da;
	char ch;

	b = a;
	c = a + 20;
	da = 3.5;
	ch = 'A';

	printf("a: %d, b: %d, c: %d, ch: %c, da: %.1lf \n", a, b, c, ch, da);

	return 0;
	/*
	int main(void)
{
   int a; // 변수의 선언 : 메모리에 변수 공간을 만드는 작업!!
   // int형 변수 -> 4byte 크기로 메모리 준비!!
   a = 10; // 변수에 값을 할당
   // 최초 할당 -> 초기화

   // 1. 정수형 변수 b와 c를 선언(int로)
   int b, c;
   // 2. 실수형 변수 da 선언 (double로)
   double da;
   // 3. 문자형 변수 ch 선언 (char로)
   char ch;
   // 4. a에 들어 있는 값으로 b를 초기화
   b = a;
   // 5. a에 들어 있는 값에 20을 더해 c를 초기화
   c = a + 20;
   // 6. da를 3.5로 초기화
   da = 3.5;
   // 7. ch를 'A'로 초기화
   ch = 'A';
   // 모든 변수 출력!!
   printf("변수 a의 값 : %d\n", a);
   printf("변수 b의 값 : %d\n", b);
   printf("변수 c의 값 : %d\n", c);
   printf("변수 da의 값 : %.1lf\n", da);
   printf("변수 ch의 값 : %c\n", ch);
   return 0;
}
	*/
}
#endif

/***********************************************************/
// [3-2] char 형 변수의 사용
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	char ch1 = 'A'; //문자로 초기화. 저장된 값은 문자의 아스키 코드 값
	int ch2 = 65;	//문자 'A'의 아스키 코드 값에 해당하는 점수로 초기화

	printf("%c %d\n", ch1, ch1);
	printf("%c %d\n", ch2, ch2);

	printf("문자 %c의 아스키 코드 값: %d\n", ch1, ch1);
	printf("아스키 코드 값이 %d인 문자 : %c\n", ch2, ch2);
	return 0;
}
#endif

/***********************************************************/
// [3-3] 여러가지 정수형 변수
/***********************************************************/

#if 0 
#include <stdio.h>

int main(void)
{
	//short, int, long, long, long
	short menu = 10000;
	int lotto = 2000000000;
	long people = 50000000;
	long long world_people = 7000000000;

	//각 타입의 정해진 범위를 벗어나면 overflow, underflow
	//overflow : 가장 큰 값에서 담을 수 있는 범위를 넘으면 가장 작은 값이됨.
	//underflow : 가장 큰 값에서 표현할 수 있는 범위를 넘으면 가장 큰 값이 됨.
	short sh = 32767; //2byte= 16bit = 2^16 = 65536 -> -32768 ~0~32767
	printf("%d\n", sh);

	//%d : int 형
	//%ld : long형
	//%lld : long long type
	printf("%d\n", menu);
	printf("%d\n", lotto);
	printf("%ld\n", people);
	printf("%lld\n", world_people);
	return 0;
}
#endif

/***********************************************************/
// [3-4] unsigned type 을 잘 못 사용한 경우
/***********************************************************/

#if 0 
#include <stdio.h>

int main(void)
{
	unsigned int a; 

	a = 4294967295;	//unsigned int의 최댓값
	printf("%d\n", a);	//overflow
	printf("%u\n", a);

	a = -1;	//재할당
	printf("%u\n", a); //unsigned 음수 출력 불가
	return 0;
}
#endif

/***********************************************************/
// [3-5] 유효 숫자 확인
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	float ft = 1.234567890123456789;	//선언과 동시에 초기화 가능.
	double db = 1.234567890123456789;
	long double ldb = 1.234567890123456789;
	printf("%.20f\n", ft);	//기본적으로 모두 6자리까지 출력함.
	printf("%.20f\n", ft);	//어느 자리부터는 근사값이 나옴.(doublg을 쓰는 이유)
	printf("%2.0llf\n", ldb);

	//결론 : double을 쓰자.

	return 0;
}
#endif

/***********************************************************/
// [3-6] char 배열에 문자열 저장
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	char fruit[20] = "orage";	//문자열 선언, 반드시 크기가 할당되어야한다. 이 크기는 정적으로 설정하는 것을 권장 
	//끝에 널문자 \0이 들어간다.
	printf("%s\n", fruit);
	return 0;

	//기본 자료형
	//short, int, long, long long
	//float, double, long double
	//char
}
#endif

/***********************************************************/
// [3-7] char 배열에 문자열 복사
/***********************************************************/
#define _CRT_SECURE_NO_WARNINGS
#if 0 
#include <stdio.h>
#include <string.h>	//문자열 관련 기능들을 포함!
//strcpy()
int main(void)
{
	char fruit[20] = "banana"; //fruit에 해당 문자를 덮어쓰기
	strcpy(fruit, "choco"); //fruit에 "choco" 복사

	printf("%s\n", fruit);

	
	return 0;
}
#endif

/***********************************************************/
// [3-8] const를 사용한 변수
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int income = 0;
	double tax;
	const double tax_rate = 0.065;	//선언과 동시에 선언해야함.

	//tax_rate = 0.2;	//const로 선언 했기 때문에 변경 불가 오류남.

	income = 800;
	tax = income * tax_rate;
	
	printf("%lf\n", tax);

	return 0;
}
#endif

/***********************************************************/
// [3-확인문제] 2
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 0; //0

	a = a + 1; //1
	a = a + 2; //3
	a = a + 3; //6
	printf("a : %d", a); //6

	return 0;
}
#endif

/***********************************************************/
// [3-확인문제] 3
/***********************************************************/

#if 0 
#include <stdio.h>

int main(void)
{
	int kor = 70;
	int eng = 80;
	int mat = 90;

	int tot= kor + eng + mat;

	printf("국어 : %d, 영어 : %d, 수학: %d\n", kor, eng, mat);
	printf("총점 : %d", tot);


	return 0;
}
#endif

/***********************************************************/
// [3-9] scanf 함수를 사용한 키보드 입력
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int age;

	printf("나이를 입력하세요 : ");
	scanf("%d", &age);	//여기서 변수 a에 값 입력
	printf("만나이 : %d\n", age-2);	//입력한 값 출력
	return 0;
}
#endif

/***********************************************************/
// [3-10] scanf 함수를 사용한 연속 입력
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int age; //나이는 정수형
	double height;	//키는 정수형

	printf("나이와 키를 입력하세요 : ");		//입력 안내 메시지 출력
	scanf("%d %lf", &age, &height); //나이와 키를 함께 입력, 식별 문자를 붙혀서 쓰나 안쓰나 상관 없음. 입력 받을때도 띄어쓰기, enter, tab 다 가능.
	printf("나이는 %d 살, 키는 %.1lf cm 입니다.\n", age, height);	//입력값 출력
	return 0;
}
#endif

/***********************************************************/
// [3-11] 문자와 문자열 입력
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	char grade;
	char fruit[20];
	scanf("%c", &grade);
	scanf("%s", fruit);
	printf("당신의 성적 : %c\n", grade);
	printf("과일의 이름 : %s", fruit);
	return 0;
}
#endif

/***********************************************************/
// [4-1] 대입 더하기 빼기 곱하기 음수 연산
/***********************************************************/

#if 0 
#include <stdio.h>

int main(void)
{
	int a, b;
	a = 10;
	b = 20;
	printf("%d + %d = %d\n", a, b, a + b);
	printf("%d - %d = %d\n", a, b, a - b);
	printf("%d * %d = %d\n", a, b, a * b);
	printf("%d\n", -a);


	return 0;
}
#endif

/***********************************************************/
// 
// /***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	double apple;
	int banana;
	int orange;
	
	apple = 5.0 / 2.0;	//2.5 실수
	banana = 5 / 2;	//5/2	//정수
	orange = 5 % 2;	//정수
	printf("%lf\n", apple);
	printf("%d\n", banana);
	printf("%d\n", orange);

	return 0;


}
#endif

/***********************************************************/
// [4-2] 자판기 동전 구하기
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	//자판기에 동전을 투입
	//잔돈을 출력하는 프로그램
	int input = 770;
	int price = 100;
	int change = input - price;
	printf("잔돈 : %d\n", input - price);
	printf("500원 짜리 : %d\n", change / 500);
	printf("100원 짜리 : %d\n", (change % 500) / 100);
	printf("50원 짜리 : %d\n", ((change % 500) % 100) / 50);
	printf("10원 짜리 : %d\n", (((change % 500) % 100) % 50) /10);

	return 0;
	/*
 // 자판기에 동전을 투입
// 잔돈을 출력하는 프로그램
int input = 770;
int price = 100; // 아침햇살
int change = input - price;
// change : 900
// ====출력문구====
// 50원짜리 : 1개
// 10원짜리 : 2개
printf("잔돈 : %d원\n", change);
printf("500원짜리 : %d개\n", change / 500);
printf("100원짜리 : %d개\n", change % 500 / 100);
// change - 500 * 500원개수 - 100 * 100원개수
// => 770 % 100 : 70
printf("50원짜리 : %d개\n", change % 100 / 50);
printf("10원짜리 : %d개\n", change % 50 / 10);
return 0;
 */
}
#endif

/***********************************************************/
// [4-3] 초가 주어졌을 때 시간 구하기
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int time = 7533;
	int hour=0, min=0, sec=0;
	
	hour = time / (60*60);
	min = time%(60*60) / 60;
	sec = (time % (60 * 60) % 60);
	printf("%d 시간 %d 분 %d 초\n", hour, min, sec);
	return 0;
	/*
	int time = 7533; // 총 초(seconds)의 수가 주어진다
	// ====출력 결과====
	// 2시간 5분 33초
	int h = time / (60 * 60);
	int m = time % (60 * 60) / 60;
	int s = time % 60;
	printf("%d시간 %d분 %d초", h, m, s);
	*/
}
#endif

/***********************************************************/
// [4-3] 증감 연산자의 연산 
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 10, b = 10;

	++a;	//증감 연산자 : 증가 연산자 + 감소 연산자
	--b;	

	printf("a : %d \n", a);
	printf("b : %d \n", b);

	return 0;
}
#endif

/***********************************************************/
// [4-4] 전위 표기와 후위 표기를 사용한 증감 연산
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 5, b = 5;
	int prefix, postfix;

	prefix = (++a) * 3;	//가장 먼저 ++, 후 이 줄 실행
	postfix = (b++) * 3;	//이줄 실행후 ++
	
	printf("%d %d\n", prefix, postfix);
	printf("%d %d", a, b);
	return 0;
}
#endif

/***********************************************************/
// [4-5] 관계 연산의 결괏값 확인
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 10, b = 20;
	printf("%d\n", a > b); //false 면 0
	printf("%d\n", a < b); //true 면 0
	printf("%d\n", a >= b);
	printf("%d\n", a <= b);
	printf("%d\n", a == b);
	printf("%d\n", a != b);

	//in clang, false = 0, true=1
	//0을 넣으면 거짓의 역할
	//1을 넣으면 참의 역할
	//하지만 c99 에서는 bool의 지원이 없다. 즉 0을 제외한 모든 숫자가 true다.

	return 0;
}
#endif

/***********************************************************/
// [4-6] 논리 연산의 결괏값 확인
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	//&&(and) 논리곱 : 같으면 1 다르면 0
	
	//||(or) 논리합 : 입력 둘 중 하나만 1이면 1

	// ! (not) 논리 부정. 입력의 반대를 출력
	int a = 30;

	printf("(a > 30) && (a < 20) : %d\n", (a > 30) && (a < 20));	//0
	printf("(a < 10) || (a > 20) : %d\n", (a < 10) || (a > 20));	//1
	printf("!(a >= 30) : %d\n", !(a >= 30));	//0
	return 0;
}
#endif

/***********************************************************/
// [4-확인] 평균을 구해보자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int kor, eng, mat, tot;
	double avg;

	printf("두 과목의 점수 :");
	scanf("%d %d %d", &kor, &eng, &mat);

	tot = kor + eng + mat;

	printf("총점수 : %d점\n", tot);
	printf("평균 점수: %.1lf점", tot / 3.0);


	return 0;
}
#endif

/***********************************************************/
// [4-8] 형 변환 연산자가 필요한 경우.
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [4-8] 형변환
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 20, b = 3;
	// a / b => 6;
	//5.0 / 2.0 => 2.51
	printf("%lf\n", (double)a);	//a를 실수타입 으로 저장
	printf("%lf\n", (double)a / b);	//b가 강제로 double로 바뀜.
	//double/int -> double
	int result = 6.66667;
	int answer = (int)result;	//소수점 뒤에가 없어짐.
	printf("%d\n", answer);
	return 0;

	//형 변환
	//자동 형변환 = 묵시적, 암시적 형변환. : 컴파일 시 자료형을 컴파일러가 알아서 바꿈.
	//implicit type casting
	//남을 수 있는 메모리가 큰 쪽으로 변환함. 대입 시에는 좌항의 변수에 맞춤.
}
#endif

/***********************************************************/
// [4-9] 연산자의 사용 예
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 10;
	double b = 3.14;
	
	printf("int형 변수의 크기 : %d\n", sizeof(a));	//4바이트
	printf("double변수의 크기 : %d\n", sizeof(b));	//8바이트
	printf("정수형 상수의 크기 : %d\n", sizeof(100));	//4바이트
	printf("수식의 결괏값의 크기 : %d\n", sizeof(1.5 + 3.4));	//8바이트
	printf("char형 자료형의 크기 : %d\n", sizeof(char));	//1바이트

	return 0;
}
#endif

/***********************************************************/
// [4-10] 복합대입 연산자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int age = 20;
	age += 1;	//age = age + 1

	int salary = 100000000;
	salary += 1.1;
	printf("%d", salary);
	return 0;
}
#endif

/*********************************************************
// [4-11] 콤마 연산자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 10, b = 20;
	int result;

	result = (++a, ++b);	//콤마가 연산자 우선순위가 낮음. 가장 마지막에 있는 것이 대입됨.
	printf("%d", result);

	return 0;
}
#endif

/***********************************************************/
// [4-12] 조건 연산자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{	
	int menu = 20;
	int lunch_menu = menu % 2 == 0 ? 1 : 0;
	printf("%d", lunch_menu);
	//홀수면 짬뽕, 짝수면 짜장
	//조건 연산자 : c언어에서 유일한 삼항 연산자
	//(조건식) ? 실햄문장1 : 실행문장2
	//조건식 == 논리 결과 (1또는 0)
	//1. 1또는 0(참또는 거진)
	//2. 관계연산자(<, > <=, <=..)
	//3. 논리 연산자(&&, ||, !)
	
	return 0;
}
#endif

/***********************************************************/
// [4-12-1] 큰 값을 구하자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	//두 정수를 입력받아, A, B에 저장 큰 수 출력하기
	int a, b;

	scanf("%d %d", &a, &b);
	printf("큰 수 : %d", a>b ? a : b);
	return 0;
}

/***********************************************************/
// [4-12-절댓값] 절댓값을 구해보자
/***********************************************************/

#if 1
#include <stdio.h>

int main(void)
{
	//사용자가 입력한 정수를 절댓값 출력하자
	int num, result;
	scanf("%d", &num);

	result = num > 0 ? num : -num;
	printf("%d", result);
	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}


/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif

/***********************************************************/
// [0-0] Ÿ��Ʋ
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{

	return 0;
}
#endif


#endif
#endif
